Tekla.Structures.ModelInternal.Operation.ImportExternalReferenceModel(System.String,System.String,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double)
Imports external reference model.
fileAndPath: Full file name and path.
basePointGuid: The base point guid. Leave empty for location by model origin. Use 49C25886-7FA7-4F2E-84E1-84ED231A22B5 for auto-created base point.
origin: The origin.
axisX: The axis X.
axisY: The axis Y.
scale: The scale.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.ResetExternalReferenceModelColoring(System.String)
Resets the given external reference models objects coloring back to default.
path: The models path.
Returns: True on success.

Tekla.Structures.ModelInternal.Operation.GetExternalReferenceModelSelections
Gets the external reference model selections.
Returns: The external reference model selections guids.

Tekla.Structures.ModelInternal.Operation.GetReferenceModelObjectCustomAttributes(System.Int32)
Gets the reference model object custom attributes.
refererenceModelObjectId: The reference model object id.
Returns: The custom attributes.

Tekla.Structures.ModelInternal.Operation.ExportIFCFromAll(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from all objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ImportSemantic(System.String,System.String)
Import semantic file. Creates native objects to TS model based on the file.
FileNameAndPath:  The semantic file name and path.
BasePointGuid: The base point guid if base point used, otherwise empty string.
Returns: True, if success.

Tekla.Structures.ModelInternal.Operation.ExportModel(System.String,System.String,System.String,System.String,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Exports TS model to file.
outPath: Output file name and path.
basePointGuid:
basePointExportType:
exportType:
propertiesPath:
selectedOnly:
assemblies:
allAssemblyParts:
parts:
rebars:
bolts:
welds:
surfaces:
surfaceTreatments:
grids:
spatialHierarchy:
pours:
onlyProperties:
Returns: True, if success.

Tekla.Structures.ModelInternal.Operation.ExportIFCFromSelected(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from selected objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromObjects(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from given objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
BasePoint: Defines which base point is used in export.
ModelObjects:  List of model objects to export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFCFromFilteredObjects(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},System.String,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from filtered objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
FilterName:  Filter file name for model objects to export.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ExportIFC(System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},System.String,System.Boolean,Tekla.Structures.Model.Operations.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.Model.Operations.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)


Tekla.Structures.ModelInternal.Operation.dotGetCurrentView(Tekla.Structures.Model.UI.View@)


Tekla.Structures.ModelInternal.Operation.FetchModelObjects(System.Collections.Generic.List{System.String},System.Boolean)
Takes a guid list of object as input, checks if guid is native or external, and
instantiates and optionally selects objects before returning them.
guids: The GUID list to look for in the model.
SelectInstances: Optional parameter whether object is selected, default = true.
Returns: The model objects with the given guids,
or empty list if any of the objects do not exists or object data loading failed for some reason.

Tekla.Structures.ModelInternal.Operation.SetPrintingController(Tekla.Structures.ModelInternal.PrintingController)
Set printing controller object on the TS side.
PrintingController: The printing controller.
Returns: True if successful.